# Taps
tap 'caskroom/cask'
tap 'caskroom/eid'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'AdoptOpenJDK/openjdk'
tap 'mongodb/brew'
tap 'heroku/brew'

# Binaries
brew 'wget'
brew 'git'
brew 'trash'
brew 'mas'
brew 'zsh'
brew 'zsh-completions'
brew 'python'
brew 'mongodb-community@4.2'
brew 'namp'


# Development
#brew 'php'
#brew 'mysql'
brew 'node'
brew 'heroku'
brew 'watchman'
brew 'ant'
brew 'maven'
brew 'gradle'
brew 'jenv'
cask 'java'
cask 'java8'
cask 'android-sdk'
cask 'android-ndk'
cask 'intel-haxm'
cask 'mongodb-compass'
cask 'wireshark'



# Apps
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'skype'
cask 'slack'
cask 'iterm2'
cask 'spotify'
cask 'TouchSwitcher'
cask 'hyperswitch' 
cask 'google-drive-file-stream' 
cask 'homebrew/cask-drivers/logitech-options'
cask 'react-native-debugger'
cask 'apptivate'
cask 'android-studio'
cask 'ProPresenter'
cask 'jetbrains-toolbox'
cask 'haptic-touch-bar'
cask 'steam'
cask 'postman'
cask 'toggl'
cask 'vlc'
cask 'sourcetree'
cask 'zeplin'
cask 'rcdefaultapp'
cask 'dash'
cask 'appcleaner'
cask 'virtualbox'
cask 'finicky'
cask 'zwift'
cask 'anaconda'
cask 'telegram-desktop'
cask 'beyond-compare'
cask 'discord'
# cask 'adoptopenjdk8'


# Fonts
#cask 'font-inconsolata-for-powerline'
#cask 'font-inconsolata'	

# Mac App Store
#mas 'WhatsApp Desktop', id: 
mas 'Giphy Capture', id: 668208984
mas 'Xcode', id: 497799835
mas 'Trello', id: 1278508951 
mas 'Keynote', id: 409183694
mas 'Evernote', id: 406056744
mas 'HyperDock', id: 449830122
mas 'Remote for HEOS', id: 1382572478
mas 'Slack', id: 803453959
mas 'Color Picker', id: 641027709
mas 'Pixelmator', id: 407963104
mas 'Amphetamine', id: 937984704
mas 'Divvy', id: 413857545
mas 'Tomato One - Free Focus Timer', id: 907364780