# Taps
tap "homebrew/bundle"
tap "adoptopenjdk/openjdk"
tap "heroku/brew"
tap "cloudflare/cloudflare"
tap "homebrew/cask-drivers"
tap "homebrew/cask-eid"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "xcodesorg/made"

# Binaries
brew "cask"
brew "wget"
brew "git"
brew "gh"
brew "trash"

# A command to download mac store app
# https://github.com/mas-cli/mas
brew "mas"

# zsh
brew "zsh"
brew "zsh-completions"


# languages / runtime environments
brew "openjdk"
brew "java"

# pkg managers
brew "maven"
brew "jenv"
brew "pnpm"
brew "ruby-build"

# pyenv
brew "openssl"
brew "tcl-tk"
brew "tcl-tk@8"
brew "readline"
brew "sqlite3" 
brew "xz" 
brew "zlib"
brew "pyenv"

# Depndencies ...
# brew "namp"
brew "cocoapods"
brew "fastlane"
brew "zsh-syntax-highlighting"
brew "heroku"
brew "watchman"
brew "ant"
brew "gradle"
cask "google-cloud-sdk"
cask "postgres-unofficial"
brew "act"
cask "xcodes"
brew "xcodesorg/made/xcodes"
brew "heroku/brew/heroku"

#mongoDB
tap "mongodb/brew"
cask "mongodb-compass"
brew "mongodb-community"

# Development
#brew "php"
#brew "mysql"
# cask "wireshark"


brew "glib"
brew "cairo"
brew "harfbuzz"
brew "icu4c@76"
brew "apr-util"
brew "libssh2"
brew "aria2"
brew "coreutils"
brew "unbound"
brew "gnutls"
# brew "emacs"
brew "cloudflared"
brew "docker-compose"
brew "folly"
brew "fizz"
brew "mvfst"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "edencommon"
brew "fd"
brew "imagemagick"
brew "jq"
brew "mongosh"
brew "nghttp2"
brew "nmap"
brew "openssl@1.1"




# Apps
cask "visual-studio-code"
cask "google-chrome"
cask "firefox"
cask "slack"
cask "iterm2"
cask "spotify"
cask "react-native-debugger"
# cask "jetbrains-toolbox"
cask "steam"
cask "postman"
cask "toggl-track"
cask "sourcetree"
cask "finicky"
cask "send-to-kindle"
cask "spacelauncher"
cask "calibre"
cask "docker"
# cask "audio-hijack"
# cask "alt-tab"
# cask "divvy"
cask "flycut"
cask "logos"
cask "karabiner-elements"
cask "hyperswitch"


# Other: 
cask "virtualbox"
cask "discord"

# Mac App Store
mas "Keynote", id: 409183694
mas "Color Picker", id: 1545870783
mas "GarageBand", id: 682658836
mas "Pixelmator", id: 407963104
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Kindle", id: 302584613
mas "Flow", id: 1423210932
mas "Dropover", id: 1355679052

# vscode "alphaxek.github-actions-locally"
# vscode "bierner.emojisense"
# vscode "chflick.firecode"
# vscode "christian-kohler.npm-intellisense"
# vscode "codezombiech.gitignore"
# vscode "dbaeumer.vscode-eslint"
# vscode "deerawan.vscode-dash"
# vscode "eamodio.gitlens"
# vscode "equinusocio.vsc-community-material-theme"
# vscode "esbenp.prettier-vscode"
# vscode "formulahendry.auto-rename-tag"
# vscode "github.copilot"
# vscode "github.copilot-chat"
# vscode "github.vscode-github-actions"
# vscode "grapecity.gc-excelviewer"
# vscode "humao.rest-client"
# vscode "idleberg.applescript"
# vscode "jpoissonnier.vscode-styled-components"
# vscode "jundat95.react-native-snippet"
# vscode "mechatroner.rainbow-csv"
# vscode "ms-azuretools.vscode-docker"
# vscode "oderwat.indent-rainbow"
# vscode "orta.vscode-jest"
# vscode "qufiwefefwoyn.inline-sql-syntax"
# vscode "rangav.vscode-thunder-client"
# vscode "redhat.java"
# vscode "sharat.vscode-brewfile"
# vscode "shopify.ruby-lsp"
# vscode "sleistner.vscode-fileutils"
# vscode "tanhakabir.rest-book"
# vscode "teabyii.ayu"
# vscode "toba.vsfire"
# vscode "visualstudioexptteam.intellicode-api-usage-examples"
# vscode "visualstudioexptteam.vscodeintellicode"
# vscode "vscjava.vscode-gradle"
# vscode "vscjava.vscode-java-debug"
# vscode "vscjava.vscode-java-dependency"
# vscode "vscjava.vscode-java-pack"
# vscode "vscjava.vscode-java-test"
# vscode "vscjava.vscode-maven"
# vscode "vscodevim.vim"
# vscode "zainchen.json"
# vscode "zhouronghui.propertylist"
# vscode "catppuccin.catppuccin-vsc"
# vscode "ms-python.debugpy"
# vscode "ms-python.python"
# vscode "ms-python.vscode-pylance"
# vscode "pdconsec.vscode-print"
# vscode "wmaurer.change-case"

# TEMP
cask "focusrite-control-2"



# Sketchbar and Yabai: 
tap "felixkratz/formulae"
tap "koekeishiya/formulae"
cask "sf-symbols"
brew "switchaudio-osx"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "koekeishiya/formulae/yabai"
brew "koekeishiya/formulae/skhd"
cask "font-hack-nerd-font"
## "jq", "bq" is a dependency for "sketchybar" and "yabai"



# INSTALLED IN OTHER SCRIPTS
# brew "rbenv"
# brew "python"