# Taps
tap "homebrew/bundle"
tap "adoptopenjdk/openjdk"
tap "heroku/brew"
tap "cloudflare/cloudflare"
tap "homebrew/cask-drivers"
tap "homebrew/cask-eid"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "xcodesorg/made"
tap "FelixKratz/formulae"

# Binaries
brew "wget"
brew "git"
brew "gh"
brew "trash"

# A command to download mac store app
# http://www.softantenna.com/wp/mac/mas-cli/
brew "mas"

# zsh
brew "zsh"
brew "zsh-completions"

# python
brew "python"

# brew "namp"
brew "koekeishiya/formulae/yabai"
brew "skhd"
brew "rbenv"
brew "ruby-build"
brew "cocoapods"
brew "fastlane"
brew "zsh-syntax-highlighting"
brew "sketchybar"

#mongoDB
tap "mongodb/brew"
cask "mongodb-compass"
brew "mongodb-community"

# Development
#brew "php"
#brew "mysql"
# cask "wireshark"
brew "node"
brew "heroku"
brew "watchman"
brew "ant"
brew "maven"
brew "gradle"
brew "jenv"
cask "java8"
cask "java11"
cask "google-cloud-sdk"
cask "postgres-unofficial"
brew "act"
cask "xcodes"
brew "xcodesorg/made/xcodes"
brew "heroku/brew/heroku"

brew "glib"
brew "cairo"
brew "harfbuzz"
brew "icu4c@76"
brew "openjdk"
brew "python@3.12"
brew "apr-util"
brew "libssh2"
brew "aria2"
brew "coreutils"
brew "unbound"
brew "gnutls"
brew "emacs"
brew "cask"
brew "cloudflared"
brew "docker-compose"
brew "folly"
brew "fizz"
brew "mvfst"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "edencommon"
brew "fd"
brew "imagemagick"
brew "jq"
brew "mongosh"
brew "nghttp2"
brew "nmap"
brew "node@10"
brew "openssl@1.1"
brew "node@12"
brew "python@3.10"
brew "node@14"
brew "node@16"
brew "node@8"
brew "nvm"
brew "openjdk@11"
brew "openjdk@17"
brew "python@3.11"
brew "tcl-tk"
brew "python@3.8"
brew "python@3.9"
brew "ruby@3.1"



# Apps
cask "visual-studio-code"
cask "google-chrome"
cask "firefox"
cask "slack"
cask "iterm2"
cask "spotify"
cask "react-native-debugger"
cask "jetbrains-toolbox"
cask "steam"
cask "postman"
cask "toggl-track"
cask "sourcetree"
cask "finicky"
cask "send-to-kindle"
cask "spacelauncher"
cask "calibre"
cask "docker"
cask "audio-hijack"
cask "alt-tab"
cask "divvy"
cask "logos"
cask "karabiner-elements"

# Fonts
cask "font-hack-nerd-font"

# Other:
cask "hyperswitch" 
cask "virtualbox"
cask "discord"

# Mac App Store
mas "Xcode", id: 497799835
mas "Keynote", id: 409183694
mas "Evernote", id: 406056744
mas "Slack", id: 803453959
mas "Color Picker", id: 1545870783
mas "GarageBand", id: 682658836
mas "Pixelmator", id: 407963104
mas "Amphetamine", id: 937984704
mas "Divvy", id: 413857545
mas "Unsplash Wallpapers", id: 1284863847
mas "Toggl Track", id: 1291898086
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Kindle", id: 302584613
mas "Flow", id: 1423210932
mas "Flycut", id: 442160987
mas "Dropover", id: 1355679052

vscode "alphaxek.github-actions-locally"
vscode "bierner.emojisense"
vscode "chflick.firecode"
vscode "christian-kohler.npm-intellisense"
vscode "codezombiech.gitignore"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-dash"
vscode "eamodio.gitlens"
vscode "equinusocio.vsc-community-material-theme"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "grapecity.gc-excelviewer"
vscode "humao.rest-client"
vscode "idleberg.applescript"
vscode "jpoissonnier.vscode-styled-components"
vscode "jundat95.react-native-snippet"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "oderwat.indent-rainbow"
vscode "orta.vscode-jest"
vscode "qufiwefefwoyn.inline-sql-syntax"
vscode "rangav.vscode-thunder-client"
vscode "redhat.java"
vscode "sharat.vscode-brewfile"
vscode "shopify.ruby-lsp"
vscode "sleistner.vscode-fileutils"
vscode "tanhakabir.rest-book"
vscode "teabyii.ayu"
vscode "toba.vsfire"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "zainchen.json"
vscode "zhouronghui.propertylist"

# TEMP
cask "focusrite-control-2"